[LANG]
language=Korean (한국)
[FONT]
font-name=Malgun Gothic
welcome-text-size=64
home-text-size=24
home-section-size=26
analysis-text-size=22
analysis-section-size=24
left-panel-size=18
panel-list-size=18
panel-list-label-size=22
panel-list-header-size=18
panel-list-item-size=15
panel-button-size=14
combobox-size=18
list-combobox-size=18
checkbox-size=16
radio-size=17
elem-size=12
image-button-size=16
form-text-size=17
list-text-size=18
search-edit-size=18
message-text-size=18
setting-button-size=14
process-text-size=16
properites-title-font=20
properites-section-font=18
log-list-item-text-size=14
log-list-item-sql-size=16
[ERROR]
000000=
200001=SQL 구문 오류
200002=파일이 존재하지 않습니다
200003=파일이 손상되었습니다
200004=매개변수 오류
200026=테이블 이름이 중복되었습니다
200027=테이블 이름이 존재하지 않습니다
200028=CSV 파일 가져오기 오류, SQL 을 생성하지 못했습니다. CSV 파일 내용과 설정 항목이 올바른지 확인하십시오.
300001=인덱스를 생성할 테이블 열이 선택되지 않았습니다
300002=SQL 문은 비워 둘 수 없습니다
300003=SQL 분석은 SELECT 쿼리 문만 지원합니다
[STRING]
home=홈
database=데이터베이스
analysis=분석
view=뷰
setting=설정
items=개 기록
tables=데이터 테이블
views=뷰
triggers=트리거
columns=열
indexes=인덱스
table=테이블
clear-all=모두 지우기
yes=확인
no=취소
welcome-text=CuteSqlite 에 오신 것을 환영합니다
home-text1=CuteSqlite 는 Sqlite3 의 그래픽 사용자 클라이언트 (GUI) 도구입니다.
home-text2=데이터베이스를 설계, 생성 및 탐색하고, 데이터베이스 객체를 처리하며,
home-text3=데이터를 삽입하고 저장된 데이터를 처리하기 위한 SQL 쿼리를 설계 및 실행할 수 있습니다.
home-text4=또한 다른 데이터베이스 공급업체에서 Sqlite 데이터베이스로 데이터베이스와 데이터를 마이그레이션할 수 있습니다.
db-section-text=Sqlite 데이터베이스
analysis-text1=CuteSqlite 를 사용하면 SQL 문의 성능을 분석하고 최적화할 수 있습니다.
analysis-text2=또한 데이터베이스의 각 테이블의 저장 용량을 분석할 수 있으며,
analysis-text3=데이터베이스의 매개변수를 구성하여 데이터베이스를 최적화할 수 있습니다.
perf-analysis-section-text=성능 분석
error-text=시스템 오류:
create-database=새 데이터베이스 만들기 (Ctrl+N)
open-database=데이터베이스 열기 (Ctrl+O)
refresh-database=데이터베이스 새로 고침 (F5)
delete-database=목록에서 선택한 데이터베이스 제거 (Del)
override-user-db=파일 데이터를 삭제하면 복구할 수 없습니다. 데이터베이스를 덮어쓰시겠습니까?
create-db-success-text=데이터베이스 생성 성공
open-db-exists-inlist=데이터베이스가 이미 열려 있습니다. 중복 작업을 하지 마십시오.
open-db-success-text=데이터베이스 열기 성공
delete-user-db=목록에서 선택한 데이터베이스 "{dbName}" 를 제거하시겠습니까?
delete-db-success-text=목록에서 데이터베이스 제거 성공
query-editor=쿼리 편집기
history=기록
history-tip=기록 (F8)
result-list=결과
result-info=정보
result-table-data=테이블 데이터
table-properties=테이블 속성
exec-select-sql=현재 선택한 쿼리 실행 (F9)
exec-all-sql=모든 쿼리 실행 (F10)
explain-select-sql=현재 선택한 SQL 문 Explain (F11)
explain-query-plan-sql=현재 선택한 SQL 문 Explain query plan (F12)
query-page-help=자동 완성 기능: [Tab]->다음 탭; [Ctrl+Space]->일치하는 탭 목록; [Ctrl+Enter]->모든 탭 목록
no-select-userdb=데이터베이스가 선택되지 않았습니다
no-sql-statement=쿼리 편집기에 SQL 문이 입력되지 않았습니다
no-sql-content=쿼리 편집기에 SQL 문이 없습니다
show-form-view=양식 뷰 표시
export-result-as=내보내기... (Ctrl+Alt+E)
copy-result-data=데이터를 클립보드에 복사
clear-all=모두 지우기
ok=확인
cancel=취소
export-text-description=데이터 내보내기 형식 선택
csv-settings=csv 옵션
csv-field-settings=열
csv-line-settings=행
csv-charset-settings=인코딩
excel-settings=Excel 옵션
sql-settings=SQL 옵션
export-fields-settings=내보낼 열 선택
terminated-by=구분 기호
enclosed-by=포함 기호
escaped-by=이스케이프 기호
field-terminated-by=열 구분 기호
field-enclosed-by=열 포함 기호
field-escaped-by=열 이스케이프 기호
line-terminated-by=줄 바꿈 기호
add-column-name=헤더에 열 이름 추가
csv-charset=인코딩
excel-column-max-size=텍스트 열 크기 제한
excel-decinmal-places=소수 자릿수
structure-only=테이블 구조만
data-only=데이터만
structure-and-data=테이블 구조 및 데이터
select-all=모두 선택
deselect-all=모두 선택 해제
save-to-file=파일로 내보내기
expert-fmt-error=데이터 내보내기 파일 형식을 선택하십시오.
terminated-by-error="종료"값을 입력하십시오.
enclosed-by-error="포함"값을 입력하십시오.
escaped-by-error="이스케이프 기호"값을 입력하십시오.
line-terminated-by-error=행의 "종료"값이 올바르지 않습니다.
excel-column-max-size-error="텍스트 열 크기 제한"값을 입력하십시오.
excel-decinmal-places-error="소수 자릿수"값을 입력하십시오.
export-sql-error=SQL 옵션을 선택하십시오.
selected-fields-error=내보낼 열을 선택하십시오.
export-path-error=내보내기 파일 경로를 입력하십시오.
sql-notsupport-multitable-query-error=다중 테이블 쿼리 및 하위 쿼리 결과 내보내기는 지원되지 않습니다.
export-success-text=내보내기 성공, {rows} 행 데이터를 내보냈습니다. 파일을 여시겠습니까?
open-the-file=파일 열기
export-file-exists-prompt={export-path} 이 (가) 이미 존재합니다. 교체하시겠습니까?
limit-rows=행 제한
offset=시작 행
rows=행 수
copy-all-rows-to-clipboard=모든 행을 클립보드에 복사	Ctrl+Alt+A
copy-sel-rows-to-clipboard=선택한 행을 클립보드에 복사	Ctrl+Alt+H
copy-all-rows-as-sql=모든 행을 SQL 로 복사	Ctrl+Alt+J
copy-sel-rows-as-sql=선택한 행을 SQL 로 복사	Ctrl+Alt+K
read-only=읽기 전용
filter=필터 (Ctrl+Alt+F)
filter-in-use=필터 사용 중
refresh=새로 고침 (Ctrl+F5)
refresh-page=새로 고침
new-row-tip=새 행 만들기 (Ctrl+Alt+N)
copy-row-tip=행 복사 (Ctrl+Alt+C)
save-tip=저장 (Ctrl+Alt+S)
delete-tip=선택한 행 삭제 (Ctrl+Del)
cancel-tip=변경 사항 취소 (Ctrl+Alt+Z)
revert-tip=복원
save=저장
revert=변경 사항 취소
column=열 이름
condition=조건
value=값
delete-confirm-text=선택한 행을 삭제하시겠습니까?
query=쿼리
result=결과
affected-rows=영향 받은 행 수
exec-time=실행 시간
transfer-time=전송 시간
total-time=총 시간
database-create=새 데이터베이스 만들기		Ctrl+N
database-open=데이터베이스 열기		Ctrl+O
database-refresh=데이터베이스 새로 고침		Ctrl+R
database-delete=데이터베이스 삭제		Del
database-copy=데이터베이스 복사...	Ctrl+P
database-export-as-sql=데이터베이스를 SQL 로 내보내기	Ctrl+E
database-import-from-sql=SQL 을 데이터베이스로 가져오기	Ctrl+I
database-new=만들기
database-new-table=테이블
database-new-view=뷰
database-new-trigger=트리거
export-as-sql-text-description=선택한 데이터베이스의 테이블/뷰/트리거를 SQL 형식으로 내보내기
select-database=선택한 데이터베이스
database-objects=객체
structure-and-data-settings=구조 및 데이터 설정
insert-statement-settings=INSERT 문 설정
tbl-statement-settings=데이터 테이블 문 설정
retain-column-text="Insert Into"에서 열 이름 유지
contain-multi-rows-text=각 "Insert"문에 여러 행 (VALUES) 포함
retain-table-text=이전 테이블 유지 (Create Table If Not Exists ...)
override-table-text=이전 테이블 덮어쓰기 (DROP TABLE, затем CREATE TABLE)
import-from-sql-text-description=SQL 파일 내의 문을 일괄 실행합니다.
abort-on-error-text=오류 발생 시 중단합니다.
import-file-not-exists=가져올 SQL 파일이 존재하지 않습니다. 다시 선택하십시오.
import-path-empty-error=가져올 파일 경로는 비워 둘 수 없습니다.
import=가져오기
export=내보내기
tbl-name=테이블 이름
new-table=테이블 만들기
new-view=뷰 만들기
new-trigger=트리거 만들기
database=데이터베이스
schema=스키마
table-columns=열
table-indexes=인덱스
table-foreignkeys=외래 키
column-name=열 이름
data-type=데이터 유형
default=기본값
check=검사
index-name=인덱스 이름
index-type=인덱스 유형
index-unique=Unique
partial-clause=부분 절
comments=주석
to-be-selected=선택 대기 열
selected=선택된 열
up=▲
down=▼
no-columns-selected=열이 선택되지 않았습니다. 선택하십시오.
sql-preview=SQL 미리 보기
tbl-name-empty=테이블 이름은 비워 둘 수 없습니다.
tbl-name-duplicated=테이블 이름이 중복되었습니다.
create-table-success-text=테이블 생성 성공.
alter-table-success-text=테이블 수정 성공.
rename-table-success-text=테이블 이름 수정 성공.
delete-column-confirm-text=선택한 열은 하나 이상의 인덱스에 의해 참조됩니다. 이 열을 삭제하면 해당 인덱스도 수정됩니다. 삭제를 계속하시겠습니까?
delete-index-confirm-text=선택한 인덱스는 하나 이상의 열에 의해 참조됩니다. 이 인덱스를 삭제하면 해당 열도 수정됩니다. 삭제를 계속하시겠습니까?
delete-confirm-text=삭제를 계속하시겠습니까?
new-view=뷰 만들기
new-trigger=트리거 만들기
create-a-view-name=새 뷰 이름
view-name-not-empty=새 뷰 이름은 비워 둘 수 없습니다.
view-name-duplicated=뷰 이름이 중복되었습니다.
create-a-trigger-name=트리거 이름
trigger-name-not-empty=트리거 이름은 비워 둘 수 없습니다.
trigger-name-duplicated=트리거 이름이 중복되었습니다.
execute-sql-success=SQL 실행 성공
copy-db-success-text=데이터베이스 복사 성공
table-open=테이블 데이터 열기		Alt+O
table-create=테이블 만들기		Alt+N
table-alter=테이블 수정		Alt+A
table-rename=테이블 이름 변경		Alt+M
table-truncate=테이블 비우기		Alt+T
table-drop=테이블 삭제		Alt+Del
table-copy-as=테이블 복사...		Alt+P
table-sharding-as=샤딩		Alt+G
table-export=테이블 내보내기...	Alt+E
table-import-sql=SQL 파일에서 가져오기	Alt+I
table-import-csv=CSV 파일에서 가져오기	Alt+J
table-manage-index=테이블 인덱스 관리
table-manage-foreign-key=테이블 외래 키 관리
properties=속성
primary-key-duplicated=기본 키 (Primary key) 가 중복 정의되었습니다.
foreignkey-name=외래 키 이름
referencing-columns=자신 테이블 열
referenced-table=외부 참조 테이블
referenced-columns=외부 참조 열
on-update=On Update
on-delete=On Delete
insert-new-column=새 열 추가
insert-new-index=새 인덱스 추가
insert-new-foreignkey=새 외래 키 추가
insert-del-column=선택한 열 삭제
insert-del-index=선택한 인덱스 삭제
insert-del-foreignkey=선택한 외래 키 삭제
select-referenced-table-first=먼저 외부 참조 테이블을 선택하십시오.
new-table-name=새 테이블 이름
table-name-not-empty=새 테이블 이름은 비워 둘 수 없습니다.
table-name-duplicated=새 테이블 이름이 중복되었습니다.
ai-column-exists=자동 증가 열 (AUTOINCREMENT) 이 이미 존재합니다.
ai-fobidden-multi-pk=자동 증가 열 (AUTOINCREMENT) 이 이미 존재하므로 여러 기본 키 열은 허용되지 않습니다.
ai-column-must-integer=자동 증가 열 (AUTOINCREMENT) 은 INTEGER 정수 유형이어야 합니다.
truncate-table-confirm-text=테이블을 비우면 데이터는 복구할 수 없습니다. 비우시겠습니까?
truncate-table-success-text=데이터 테이블 비우기 성공
drop-table-confirm-text=데이터 테이블을 삭제하면 데이터는 복구할 수 없습니다. 삭제하시겠습니까?
drop-table-success-text=데이터 테이블 삭제 성공
copy-table-text-description=복사 매개변수 구성, 데이터 테이블 샤딩 지원
from-db-name=원본 데이터베이스
from-tbl-name=원본 테이블
to-db-name=대상 데이터베이스
to-tbl-name=대상 테이블
table-sharding-setttings=데이터 테이블 샤딩
enable-table-sharding=데이터 테이블 샤딩 활성화
table-suffix-begin={suffix} 시작 정수
table-suffix-end={suffix} 종료 정수
advanced-settings=테이블 샤딩 고급 옵션
enable-copy-data-with-strategy=전략 활성화, 데이터를 샤딩 테이블로 복사
sharding-strategy-express-text=테이블 분할 전략 식: {n}
preview-sql=SQL 문 미리 보기
structure-and-data-settings-unknown=구조 및 데이터 설정이 선택되지 않았습니다.
table-suffix-error=샤딩 정수가 유효하지 않습니다. 올바른 값을 입력하십시오.
target-table-name-no-n=대상 테이블에는 문자열 "{n}" 이 (가) 포함되어야 합니다.
sharding-strategy-express-empty=테이블 분할 전략 식은 비워 둘 수 없습니다.
copy-table-success-text=테이블 복사 성공.
start=시작
complete=완료
express-title=테이블 분할 전략 식
functions=함수
express-editor-help=식 - 함수 또는 열을 더블 클릭하여 편집기에 삽입
import-from-csv-text-description=CSV 파일에서 데이터 가져오기 설정 항목
source-csv-file=원본 CSV 파일 경로
target-database=대상 데이터베이스
target-table=대상 테이블
columns-setttings=열
csv-data=CSV 데이터
column-name-on-top=첫 번째 행을 열 이름으로 사용
line-terminated-by=줄 바꿈 기호
csv-null-as-keyword=null/NULL 을 SQL 키워드로 사용
encoding=Encoding
import-success-text=가져오기 성공
incorrect-sql-statement=잘못된 SQL 문
import-error-text=가져오기 오류
table-manage-columns=열 관리
table-drop-column=열 삭제
table-manage-indexes=인덱스 관리
table-drop-index=인덱스 삭제
create-view=새 뷰 만들기
open-view=뷰 열기
drop-view=뷰 삭제
create-trigger=트리거 만들기
open-trigger=트리거 열기
drop-trigger=트리거 삭제
drop-view-confirm-text=뷰를 삭제하면 뷰는 복구할 수 없습니다. 삭제하시겠습니까?
drop-view-success-text=뷰 삭제 성공
drop-trigger-confirm-text=트리거를 삭제하면 트리거는 복구할 수 없습니다. 삭제하시겠습니까?
drop-trigger-success-text=트리거 삭제 성공
sql-templates=SQL 문 템플릿
pragma-templates=Pragmas
sql-log=SQL 기록
clear-all=모두 지우기
use=사용
explain=Explain
top=최상단
untop=최상단 해제
copy=복사
delete=삭제
today=오늘
yestoday=어제
delete-sql-log-confirm-text=SQL 로그를 삭제하시겠습니까?
copy-to-clipboard=클립보드에 복사됨
save-success-text=저장 성공
delete-success-text=삭제 성공
data-has-changed=데이터가 변경되었습니다. 페이지를 닫으시겠습니까?
not-save-and-close=저장하지 않고 닫기
cancel=닫기 취소
table-export-as=데이터 테이블 내보내기	Alt+E
export-as-sql-success-text=내보내기 성공, 파일을 여시겠습니까?
new-query=새 쿼리 창 만들기 (F7)
save-current=현재 저장 (Ctrl+S)
save-all=모두 저장 (Ctrl+Shift+S)
first-page=첫 페이지
prev-page=이전 페이지
next-page=다음 페이지
last-page=마지막 페이지
save-if-data-has-changed=데이터가 변경되었습니다. 먼저 저장하시겠습니까?
unsort=정렬 해제
tab-close-this=닫기
tab-close-others=기타 닫기
tab-close-left=왼쪽 모두 닫기
tab-close-right=오른쪽 모두 닫기
perf-analysis=성능 분석
perf-analysis-reports=분석 보고서
store-analysis=저장소 분석
db-params=데이터베이스 매개변수
not-select-sql=SELECT 문만 지원합니다.
open-sql-log=SQL 로그를 열어 성능 분석 (Ctrl+L)
add-sql-analysis=SQL 문을 입력하여 성능 분석 (Ctrl+I)
sql-log-not-found=SQL 로그를 찾을 수 없습니다. 삭제되었는지 확인하십시오.
original-sql=원본 SQL 문
where-clause-analysis=WHERE 절 분석
order-clause-analysis=ORDER 절 분석
covering-index-analysis=커버링 인덱스 분석
table-join-analysis=Joins 분석
in-table=데이터 테이블
where-use-column=WHERE 문에서 열 사용
order-use-column=ORDER 문에서 열 사용
covering-index-column=WHERE 및 ORDER 문에서 열 사용
where-use-index=WHERE 문에서 인덱스 사용
order-use-index=ORDER 문에서 인덱스 사용
use-covering-index=커버링 인덱스 사용
create-index-for-performance=권장: 다음 열에 인덱스를 생성하면 쿼리 성능이 향상됩니다.
hint-index-for-performance=힌트: 인덱스{hintIndexName} 이 (가) 포함된 열을 커버합니다: {hintIndexColumns}
create-covering-index-for-performance=권장: 다음 열에 커버링 인덱스를 생성하면 쿼리 성능이 향상됩니다.
create-index-togeger=인덱스 생성
create-index-individ=개별 인덱스 생성
create-covering-index=커버링 인덱스 생성
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=아래 의사 코드는 쿼리 최적화기의 실행 과정을 보여줍니다.
cycle-count=루프 통계
optimize-cycle-count=힌트: JOIN 테이블 순서를 변경하면 루프 횟수를 최적화하여 줄일 수 있습니다.
general-settings=일반 설정
about=정보
language-setting=인터페이스 언어 설정
change-language-restart-text=언어를 변경하려면 이 소프트웨어를 다시 시작해야 합니다.
close-and-restart=닫기 및 다시 시작
do-not-restart=다시 시작 안 함
about-us=회사 정보
about-us-description=CuteSqlite 는 작성자 Xuehan Qin 이 개발한 오픈 소스 소프트웨어입니다.
version-info=버전
version-info-description=CuteSqlite v0.2.2 beta (64 비트)
feedback=피드백
feedback-description=소프트웨어 문제가 있거나 이 애플리케이션에 대한 아이디어 및 제안이 있으면 아래 양식을 작성하여 피드백해 주십시오.
content-text=내용
license=Apache License Version 2.0
select-columns-analysis=Select 열 분석
select-use-column=Select 문에서 다음 열 사용
select-use-column-count=열 수
select-use-column-advice=권장: SELECT 문에서 선택된 열이{maxColumns} 개를 초과했습니다. 열을 줄이면 쿼리 성능이 향상됩니다.
select-use-column-tips=힌트: 열을 줄이면 쿼리 성능이 향상됩니다.
sql-perf-report-prefix=sql-perf-report-
store-analysis-prefix=저장소 분석:
analysis-sql=SQL 분석
open-perf-report=보고서 열기		Alt+O
drop-perf-report=보고서 삭제		Alt+Del
drop-perf-report-confirm-text=보고서를 삭제하시겠습니까?
store-analysis-text=데이터베이스, 데이터 테이블, 테이블 인덱스의 저장 용량을 분석할 수 있습니다.
table-store-analysis=테이블 - {tblName}
index-store-analysis=인덱스 - {idxName} - 소속 테이블:{tblName}
db-disk-used-title=디스크 공간 사용률 보고서, DB 경로:{dbPath}
page-size-text=페이지 크기 (단위: 바이트)
page-size-tips=페이지 크기 (단위: 바이트)
file-bytes-text=파일 크기 (단위: 바이트)
file-bytes-tips=파일 크기 (단위: 바이트)
file-pgcnt-text=전체 파일의 페이지 수 (측정값)
file-pgcnt-tips=전체 파일의 페이지 수 (측정값)
file-pgcnt2-text=전체 파일의 페이지 수 (계산값)
file-pgcnt2-tips=전체 파일의 페이지 수 (계산값)
inuse-pgcnt-text=데이터 저장 페이지 수 (사용 중)
inuse-pgcnt-tips=데이터 저장 페이지 수 (사용 중)
free-pgcnt2-text=데이터 저장 안 된 페이지 수 (각 헤더)
free-pgcnt2-tips=데이터 저장 안 된 페이지 수 (각 헤더)
free-pgcnt-text=데이터 저장 안 된 페이지 수 (계산값)
free-pgcnt-tips=데이터 저장 안 된 페이지 수 (계산값)
av-pgcnt-text=자동 삭제된 페이지 수
av-pgcnt-tips=자동 삭제된 페이지 수
ntable-text=데이터베이스 내 테이블 수
ntable-tips=데이터베이스 내 테이블 수
nindex-text=인덱스 수
nindex-tips=인덱스 수
nmanindex-text=정의 인덱스 수
nmanindex-tips=정의 인덱스 수
nautoindex-text=암시 인덱스 수 (자동 증가 인덱스)
nautoindex-tips=암시 인덱스 수 (자동 증가 인덱스)
user-payload-text=사용자 유효 부하 저장 바이트 수
user-payload-tips=사용자 유효 부하 저장 바이트 수
all-tbl-entrycnt-title=모든 테이블 데이터량 (건수)
all-tbl-idx-pagecnt-title=모든 테이블 및 인덱스의 페이지 수
sperate-tbl-idx-pagecnt-title=모든 테이블 및 인덱스의 페이지 수分別 계산
all-tbl-idx-report-title=모든 테이블 및 인덱스
total-pages-percent-text=데이터베이스 총 수의 비율
total-pages-percent-tips=데이터베이스 총 수의 비율
nentry-text=데이터량 (건수)
nentry-tips=데이터량 (건수)
storage-text=소비된 저장 바이트 수
storage-tips=소비된 저장 바이트 수
compressed-size-text=압축 후 사용된 바이트 수
compressed-size-tips=압축 후 사용된 바이트 수
payload-text=유효 부하의 바이트 수
payload-tips=유효 부하의 바이트 수
total-meta-text=메타데이터의 바이트 수
total-meta-tips=메타데이터의 바이트 수
depth-text=B 트리 깊이
depth-tips=B 트리 깊이
avg-payload-text=각 데이터의 평균 유효 부하
avg-payload-tips=각 데이터의 평균 유효 부하
avg-unused-text=각 데이터의 평균 미사용 바이트 수
avg-unused-tips=각 데이터의 평균 미사용 바이트 수
avg-meta-text=각 데이터의 평균 메타데이터
avg-meta-tips=각 데이터의 평균 메타데이터
avg-fanout-text=평균 fanout 수
avg-fanout-tips=평균 fanout 수
gap-cnt-text=비연속 페이지
gap-cnt-tips=비연속 페이지
mx-payload-text=각 데이터의 최대 유효 부하
mx-payload-tips=각 데이터의 최대 유효 부하
ovfl-cnt-text=사용된 오버플로 데이터 건수
ovfl-cnt-tips=사용된 오버플로 데이터 건수
int-pages-text=사용된 인덱스 페이지 수
int-pages-tips=사용된 인덱스 페이지 수
leaf-pages-text=사용된 리프 페이지 수
leaf-pages-tips=사용된 리프 페이지 수
ovfl-pages-text=사용된 오버플로 페이지 수
ovfl-pages-tips=사용된 오버플로 페이지 수
total-pages-text=사용된 총 페이지 수
total-pages-tips=사용된 총 페이지 수
int-unused-text=인덱스 페이지 상의 미사용 바이트 수
int-unused-tips=인덱스 페이지 상의 미사용 바이트 수
leaf-unused-text=리프 페이지 상의 미사용 바이트 수
leaf-unused-tips=리프 페이지 상의 미사용 바이트 수
ovfl-unused-text=오버플로 페이지 상의 미사용 바이트 수
ovfl-unused-tips=오버플로 페이지 상의 미사용 바이트 수
total-unused-text=모든 페이지 상의 미사용 바이트 수
total-unused-tips=모든 페이지 상의 미사용 바이트 수
all-table-report-title=모든 테이블 (인덱스 제외)
all-indices-report-title=모든 인덱스 (테이블 제외)
tbl-and-all-idx-report-title=테이블 {tblName} 및 모든 인덱스
tbl-only-report-title=테이블 {tblName} 인덱스 제외
idx-only-report-title=테이블 {tblName} 의 모든 인덱스
tbl-report-title=테이블 {tblName}
idx-report-title=테이블 {tblName} 의 인덱스 {idxName}
props-tbl-only-report-title=테이블 {tblName} 저장소 분석
props-idx-props-only-report-title=테이블 {tblName} 의 모든 인덱스
db-pragma-params=PRAGMA 매개변수
db-quick-config-params=빠른 구성方案
select-pragma=PRAGMA
pragma-analysis-limit-tips=근사 분석 (ANALYZE) 설정의 제한을 쿼리 또는 변경합니다. 이는 분석 (ANALYZE) 명령이 각 인덱스에서 확인하는 대략적인 행 수입니다.
pragma-application-id-tips=데이터베이스 헤더 내 오프셋 68 에 있는 32 비트 부호付き빅엔디안"Applicatioin ID"정수를 쿼리 또는 설정하는 데 사용됩니다.
pragma-auto-vacuum-tips=데이터베이스 내 자동 삭제 상태를 쿼리 또는 설정합니다.
pragma-automatic-index-tips=자동 인덱스 기능을 쿼리, 설정 또는 제거합니다.
pragma-busy-timeout-tips=바쁨 시간 초과 (busy timeout) 설정을 쿼리 또는 변경합니다.
pragma-cache-size-tips=각 열린 데이터베이스 파일마다 메모리 내에 유지되는 SQLite 권장 최대 데이터베이스 디스크 페이지 수를 쿼리 또는 변경합니다.
pragma-cache-spill-tips=트랜잭션 중 더티 캐시 페이지를 데이터베이스 파일로 오버플로우시키는 페이지어 기능을 활성화 또는 비활성화합니다.
pragma-case-sensitive-like-tips=LIKE 연산자의 기본 동작은 ASCII 문자의 대소문자를 무시하는 것입니다. 따라서 기본적으로'a'LIKE'A'는 true 입니다.
pragma-cell-size-check-tips=디스크에서 데이터베이스 B 트리 페이지를 처음 읽을 때 다른 건전성 검사를 활성화 또는 비활성화합니다. 셀 크기 검사를 활성화하면 데이터베이스 손상을 더 일찍 감지할 수 있으며"확산 (Spread)"될 가능성이 적습니다.
pragma-checkpoint-fullfsync-tips=체크포인트 작업의 fullfsync 플래그를 쿼리 또는 변경합니다. 이 플래그가 설정되면 F_FULLFSYNC 를 지원하는 시스템에서 체크포인트 작업 실행 중 F_FULLFSYNC 동기화 방법이 사용됩니다. CHECKPOINT_FULLFSYNC 플래그의 기본값은 OFF 입니다. Mac OS-X 만 F_FULLFSYNC 를 지원합니다.
pragma-collation-list-tips=현재 데이터베이스 연결에 정의된照合順序의 목록을 반환합니다.
pragma-compile-options-tips=SQLite 를 빌드할 때 사용된 컴파일 시 옵션 이름을 한 줄씩 반환합니다.
pragma-count-changes-tips=카운트 변경 플래그를 쿼리 또는 변경합니다. 일반적으로 count-changes 플래그가 설정되지 않은 경우 INSERT, UPDATE 및 DELETE 문은 데이터를 반환하지 않습니다.
pragma-data-store-directory-tips=sqlite3_data_directory 전역 변수 값을 쿼리 또는 변경합니다. Windows 운영 체제 인터페이스 백엔드는 상대 경로 이름으로 지정된 데이터베이스 파일의 저장 위치를 결정하기 위해 이 변수를 사용합니다.
pragma-data-version-tips=데이터베이스 파일이 수정되었음을 나타냅니다. 메모리 내 데이터베이스 내용을 저장하거나 화면에 데이터베이스 내용을 표시하는 인터랙티브 프로그램은 PRADMA data_version 명령을 사용하여 메모리를 새로 고치고 다시 로드하거나 화면 표시를 업데이트해야 하는지 여부를 결정할 수 있습니다.
pragma-default-cache-size-tips=각 열린 데이터베이스 파일에 할당될 권장 최대 디스크 캐시 페이지 수를 쿼리 또는 설정합니다.
pragma-defer-foreign-keys-tips=모든 외래 키 제약을 가장 바깥쪽 트랜잭션의 커밋까지 지연시킵니다.
pragma-empty-result-callbacks-tips=빈 결과 콜백 플래그를 쿼리 또는 변경합니다.
pragma-encoding-tips=주 데이터베이스에서 사용되는 텍스트 인코딩. 'UTF-8', 'UTF-16le'(리틀 엔디안 UTF-16 인코딩) 또는'UTF-16be'(빅 엔디안 UTF-16 인코딩) 중 하나.
pragma-foreign-key-check-tips=데이터베이스 또는 테이블에 외래 키 제약 위반이 있는지 확인합니다.
pragma-foreign-keys-tips=외래 키 제약 이행을 쿼리, 설정 또는 제거합니다.
pragma-freelist-count-tips=데이터베이스 파일 내 미사용 페이지 수를 반환합니다.
pragma-full-column-names-tips=full_column_names 플래그를 쿼리 또는 변경합니다.
pragma-fullfsync-tips=fullfsync 플래그를 쿼리 또는 변경합니다. 이 플래그는 F_FULLFSYNC 동기화 방법을 지원하는 시스템에서 해당 방법 사용 여부를 결정합니다. Fullfsync 플래그의 기본값은 OFF 입니다. Mac OS X 만 F_FULLFSYNC 를 지원합니다.
pragma-hard-heap-limit-tips=단일 프로세스 내 모든 데이터베이스 연결의 힙 메모리 양에 제한을 둡니다.
pragma-ignore-check-constraints-tips=검사 제약 강제를 활성화 또는 비활성화합니다. 기본 설정은 OFF 로, 이는 기본적으로 검사 제약이 강제됨을 의미합니다.
pragma-incremental-vacuum-tips=최대 N 개의 페이지를 프리 리스트에서 삭제합니다.
pragma-integrity-check-tips=데이터베이스에 대해 저수준 포맷 및 일관성 검사를 실행합니다.
pragma-journal-mode-tips=현재 데이터베이스 연결과 연관된 데이터베이스의 저널 모드를 쿼리 또는 설정합니다.
pragma-journal-size-limit-tips=트랜잭션 또는 체크포인트 후 파일 시스템에 남아 있는 롤백 로그 및 WAL 파일 크기를 제한합니다.
pragma-legacy-alter-table-tips=legacy_alter_table 플래그 값을 설정 또는 쿼리합니다.
pragma-locking-mode-tips=데이터베이스 연결 잠금 모드를 설정 또는 쿼리합니다. 잠금 모드는 일반 모드 (NORMAL) 또는 배타적 모드 (EXCLUSIVE) 입니다.
pragma-max-page-count-tips=데이터베이스 파일 내 최대 페이지 수를 쿼리 또는 설정합니다.
pragma-mmap-size-tips=단일 데이터베이스 상의 메모리 맵 I/O(memory-mapped I/O) 에 유지될 최대 바이트 수를 쿼리 또는 변경합니다.
pragma-module-list-tips=데이터베이스 연결에 등록된 가상 테이블 모듈 목록을 반환합니다.
pragma-optimize-tips=데이터베이스를 최적화하려고 합니다.
pragma-page-count-tips=데이터베이스 파일 내 총 페이지 수를 반환합니다.
pragma-page-size-tips=데이터베이스의 페이지 크기를 쿼리 또는 설정합니다. 페이지 크기는 512% 와 65536 사이의 2 의 거듭제곱이어야 합니다.
pragma-parser-trace-tips=SQLite 내부에서 사용되는 SQL 파서의 추적을 켭니다. SQLITE_DEBUG 로 컴파일 시生效됩니다.
pragma-query-only-tips=데이터베이스 파일 상의 데이터 변경을 방지합니다. 이것이 활성화되면 CREATE, REPORT, DROP, REPORT 또는 UPDATE 시도는 모두 SQLITE_READONLY 오류를 발생시킵니다.
pragma-quick-check-tips=데이터베이스에 대해 저수준 포맷 설정 및 일관성 검사를 실행하고 UNIQUE 및 인덱스 일관성 검사를 건너뜁니다.
pragma-read-uncommitted-tips=READ UNCOMMITTED 격리를 쿼리, 설정 또는 제거합니다.
pragma-recursive-triggers-tips=트리거의 재귀 기능을 쿼리, 설정 또는 제거합니다.
pragma-reverse-unordered-selects-tips=활성화되면 이 PRAGMA 는 ORDER BY 절이 없는 많은 SELECT 문이 일반적으로 반대 순서로 결과를 발행하도록 합니다.
pragma-schema-version-tips=데이터베이스 헤더 내 오프셋 40 处的 chema-versio 정수 값을 가져오거나 설정합니다.
pragma-secure-delete-tips=안전 삭제 (secure-delete) 설정을 쿼리 또는 변경합니다.
pragma-short-column-names-tips=짧은 열 이름 플래그를 쿼리 또는 변경합니다.
pragma-soft-heap-limit-tips=단일 프로세스 내 모든 데이터베이스 연결에 대해 점유하는 힙 메모리 양을 제한합니다.
pragma-stats-tips=테이블 및 인덱스에 대한 보조 정보를 반환합니다.
pragma-synchronous-tips="동기화 (synchronous)"플래그 설정을 쿼리 또는 변경합니다.
pragma-temp-store-tips=sqlite3_temp_directory 전역 변수 값을 쿼리 또는 변경합니다. 많은 운영 체제 인터페이스 백엔드는 임시 테이블 및 인덱스를 저장할 위치를 결정하기 위해 이 변수를 사용합니다.
pragma-threads-tips=준비된 문 (prepared statement) 이 쿼리를 지원하기 위해 시작하는 보조 스레드 수.
pragma-trusted-schema-tips=스키마 내에서 안전 검토되지 않은 SQL 함수 및 가상 테이블 실행을 허용할지 여부. 뷰, 트리거 또는 스키마 식 (CHECK 제약, DEFAULT 절, 생성 열, 식 인덱스 및/또는 부분 인덱스 등) 이 안전 검토되지 않은 SQL 함수 및 가상 테이블을 실행하는 것을 허용할지 여부를 결정합니다.
pragma-user-version-tips=데이터베이스 헤더 내 오프셋 60 处的 user-version 정수 값을 가져오거나 설정합니다.
pragma-vdbe-addoptrace-tips=완전한 VDBE 오피코드가 코드 생성 중 생성될 때 표시됩니다. SQLite 가 SQLITE_DEBUG 옵션으로 컴파일되고 vdbe_debug 가 켜져 있어야 합니다.
pragma-vdbe-debug-tips=VDBE 디버그를 켭니다. SQLite 가 SQLITE_DEBUG 옵션으로 컴파일되어 있어야 합니다.
pragma-vdbe-listing-tips=표준 출력에 완전한 가상 머신 오피코드 목록을 표시합니다. SQLite 가 SQLITE_DEBUG 옵션으로 컴파일되고 vdbe_debug 가 켜져 있어야 합니다.
pragma-vdbe-trace-tips=계산 시 표준 출력에 가상 머신 오피코드를 인쇄합니다. SQLite 가 SQLITE_DEBUG 옵션으로 컴파일되고 vdbe_debug 가 켜져 있어야 합니다.
pragma-wal-autocheckpoint-tips=선행 쓰기 로그 (write-ahead log)/auto-checkpoint 간격을 쿼리 또는 설정합니다.
pragma-wal-checkpoint-tips=데이터베이스 연결 D 상의 데이터베이스 X 의 선행 쓰기 로그 (write-ahead log) 내용을 데이터베이스 파일로 전송하고 선행 쓰기 로그 (write-ahead log) 를 재설정합니다.
pragma-writable-schema-tips=일반 UPDATE, INSERT 및 DELETE 문을 사용하여 sqlite_schema 테이블을 변경할 수 있습니다. 경고: 이 컴파일 지시를 남용하면 데이터베이스 파일 손상을 초래할 수 있습니다.
pragma-save-confirm=PRAGMA 문은 데이터베이스 실행에 영향을 줍니다. 아래 문을 실행하시겠습니까?
confirm-exec-text=확인&실행